	
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура - Установить стандартные настройки интерфейса программы:
//
Процедура УстановитьСтандартныеНастройкиИнтерфейсаПрограммы() Экспорт 
	
	инкОбщийСервер.УстановитьСтандартныеНастройкиИнтерфейсаПрограммыНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

// Процедура - Установить отборы на форме
//
// Параметры:
//  Список	 - Список	 - Список формы для отборов
//
Процедура УстановитьОтборыНаФорме(Список) Экспорт
	
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	
	ДобавитьОтборПоОрганизации = Истина;            
	ПолеКомпоновкиОрганизация = Новый ПолеКомпоновкиДанных("Организация");
	
	Для каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиОрганизация Тогда
			ДобавитьОтборПоОрганизации = Ложь; 		
		КонецЕсли;
		
	КонецЦикла;                              
	
	Если ДобавитьОтборПоОрганизации Тогда
		ЭлементОтбораПользовательский =  ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПользовательский.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
		ЭлементОтбораПользовательский.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораПользовательский.ЛевоеЗначение = ПолеКомпоновкиОрганизация;
		ЭлементОтбораПользовательский.ПравоеЗначение = Неопределено;
		ЭлементОтбораПользовательский.Использование = Ложь;                            
		ЭлементОтбораПользовательский.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить полное имя формы
//
// Параметры:
//  ЭтаФорма - Форма	 - Форма объекта
//  ИмяФормы - Строка	 - Имя формы
// 
// Возвращаемое значение:
//  Строка - Полный путь к форме
//
Функция ПолучитьПолноеИмяФормы(ЭтаФорма,ИмяФормы) Экспорт

	ИмяФормыСтрока = Лев(ЭтаФорма.ИмяФормы, Найти(ЭтаФорма.ИмяФормы,".Форма.")+6)+ИмяФормы;
	Возврат ИмяФормыСтрока; 
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти


