
// Процедура - Установить стандартные настройки интерфейса программы:
//
Процедура УстановитьСтандартныеНастройкиИнтерфейсаПрограммы() Экспорт 
	
	инкОбщийСервер.УстановитьСтандартныеНастройкиИнтерфейсаПрограммыНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

// Процедура - Установить отбор на форме
//
Процедура УстановитьОтборыНаФорме(Список) Экспорт
	
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	
	ДобавитьОтборПоОрганизации = Истина;            
	ПолеКомпоновкиОрганизация = Новый ПолеКомпоновкиДанных("Организация");
	
	Для каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиОрганизация Тогда
			ДобавитьОтборПоОрганизации = Ложь; 		
		КонецЕсли;
		
	КонецЦикла;                              
	
	Если ДобавитьОтборПоОрганизации Тогда
		ЭлементОтбораПользовательский =  ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПользовательский.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
		ЭлементОтбораПользовательский.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораПользовательский.ЛевоеЗначение = ПолеКомпоновкиОрганизация;
		ЭлементОтбораПользовательский.ПравоеЗначение = Неопределено;
		ЭлементОтбораПользовательский.Использование = Ложь;                            
		ЭлементОтбораПользовательский.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает полный путь к форме внешней обработки, отчета или любого объекта метаданных в виде
// ВнешняяОбработка.ИмяВнешнейОбработки.Форма.ИмяФормы
// ВнешнийОтчет.ИмяВнешнегоОтчета.Форма.ИмяФормы
// Документ.ИмяОбъекта.Форма.ИмяФормы
//
// ** coded by Sergey (aka Porutchik) * 2012, http://forum.aeroion.ru/
//
// Параметры
//  ИмяФормы  - - имя формы объекта
//
// Возвращаемое значение:
//      - полный путь к форме
//
Функция ПолучитьПолноеИмяФормы(ЭтаФорма,ИмяФормы) Экспорт

	ИмяФормыСтрока = Лев(ЭтаФорма.ИмяФормы, Найти(ЭтаФорма.ИмяФормы,".Форма.")+6)+ИмяФормы;
	Возврат ИмяФормыСтрока; 
	
	//СимволТочка = ".";
	//ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
	//Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл ПозицияТочки = ПозицияТочки - 1; КонецЦикла; //
	//Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;

КонецФункции