
#Область о // Общие процедуры и функции:

// Функция - Нормализация строки (Первая буква большая, а остальные маленькие)
//
// Параметры:
//  Строка	 - Строка	 - Строка
// 
// Возвращаемое значение:
//   - Строка
//
Функция НормализацияСтроки(Строка) Экспорт
	
	Возврат Врег(Лев(Строка,1)) + Нрег(Сред(Строка,2));

КонецФункции

// Проверка наличия реквезита в объекте:
Функция ЕстьСвойство(Объект, ИмяСвойства) Экспорт
	
	РезультатФункции = Ложь;
    НачальноеЗНачение = Новый УникальныйИдентификатор();
    ЗначениеРеквизита = Новый Структура(ИмяСвойства, НачальноеЗНачение);
	
	ЗаполнитьЗначенияСвойств(ЗначениеРеквизита, Объект);
    Если ЗначениеРеквизита[ИмяСвойства] <> НачальноеЗНачение Тогда
        РезультатФункции = Истина;
    КонецЕсли;
    Возврат РезультатФункции;
	
КонецФункции

// Выводит сообщение пользователю:     
Процедура СообщитьПользователю(Текст, ВыводСообщений = Истина, ОбъектДанных = Неопределено, Поле = "") Экспорт
	
	Если ВыводСообщений Тогда
		
		Текст = Строка(ТекущаяДата())+ ": " + Текст;
		
		Если ОбъектДанных = Неопределено Тогда
			
			Сообщить(Текст); 
					
		Иначе 
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = Текст;
			Сообщение.УстановитьДанные(ОбъектДанных);
			Сообщение.Поле = Поле;
			Сообщение.Сообщить();			

		КонецЕсли;
		
	КонецЕсли;

	инкОбщийСервер.ЗаписатьТекстВЖурналОперацийНаСервере(Текст);

КонецПроцедуры    

// Функция - Финансовое округление. Корректно округляет до двух копеек.
//
// Параметры:
//  ФинансововеЧисло - Число      - Число для огругления. 
// 
// Возвращаемое значение:
//   - Число. 
//
Функция ФинансовоеОкругление(ФинансововеЧисло) Экспорт
    
    ФинансововеЧисло = Окр(ФинансововеЧисло,3);
    ФинансововеЧисло = Окр(ФинансововеЧисло,2,РежимОкругления.Окр15как20); 
    
    Возврат ФинансововеЧисло; 
    
КонецФункции                                           

// Функция - Найти числа в строке
//
// Параметры:
//  Строка	 - строка - строка с числами
// 
// Возвращаемое значение:
//   - Массив - Массив чисел
//
Функция НайтиЧислаВСтроке(Строка) Экспорт

   МассивЧисел = Новый Массив; // сюда поместим все найденные числа. В данном примере в массив должно попасть 3 числа: 234224, 555 и 1
   
   СтрокаЧисел = "";

   Для Индекс = 1 По СтрДлина(Строка) Цикл
   
      Символ = Сред(Строка, Индекс, 1); // Перебираем все сиволы из нашей строки

      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      ИначеЕсли СтрДлина(СтрокаЧисел) > 0 Тогда
         МассивЧисел.Добавить(СтрокаЧисел);
      КонецЕсли;
   
   КонецЦикла;

   Возврат МассивЧисел

КонецФункции

#КонецОбласти

#Область о // Работа с датой и временем:

// Функция - Квартал по дате
//
// Параметры:
//  Дата -  дата    - дата по которой определяется квартал
// 
// Возвращаемое значение:
//   - число - номер квартала
//
Функция КварталПоДате(Дата) Экспорт  
    
    Возврат Цел((Месяц(Дата) - 1) / 3) + 1
    
КонецФункции

// Получить номер квартала по номеру месяца
Функция КварталПоМесяцу(НомерМесяца) Экспорт
	
	Квартал = 0 ;
	Если (НомерМесяца >= 1) И (НомерМесяца <= 3) Тогда
		Квартал = 1;	
	ИначеЕсли (НомерМесяца >= 4) И (НомерМесяца <= 6) Тогда 	
		Квартал = 2;
	ИначеЕсли (НомерМесяца >= 7) И (НомерМесяца <= 9) Тогда 	
		Квартал = 3;
	ИначеЕсли (НомерМесяца >= 10) И (НомерМесяца <= 12) Тогда 	
		Квартал = 4;		
	КонецЕсли;
		
	Возврат Квартал;	
		
КонецФункции

#КонецОбласти