
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыПоУмолчанию(Параметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоУмолчанию(Параметры)

	мОтразитьВДиалоге = Истина;
	Если Параметры.Свойство("ЧасыПлан") Тогда
		мКоличествоЧасовПлан = Параметры.ЧасыПлан;
	КонецЕсли;
	Если Параметры.Свойство("ЧасыФакт") Тогда
		мКоличествоЧасовФакт = Параметры.ЧасыФакт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЧасы(Команда)
	
	Если мКоличествоЧасов = 0 Тогда
		Сообщить("Необходимо добавить количество часов.");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ВыполненоПоЗадаче",мВыполненоПоЗадаче);
	ПараметрыЗакрытия.Вставить("КоличествоЧасов",мКоличествоЧасов);
	ПараметрыЗакрытия.Вставить("ОтразитьВДиалоге",мОтразитьВДиалоге);

	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры
