
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНачальнымиДанными(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Наименование;  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальнымиДанными(Параметры)
	
	мИДСообщения = Новый УникальныйИдентификатор;
	мДатаСообщения = ТекущаяДата();
	
	Объект.Статус = Перечисления.инкСтатусыЗадач.БыстраяЗаметка;	

	Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"Проект") Тогда
		Объект.Проект = Параметры.Проект;
	КонецЕсли;
	
	// Исполнитель записывается в модуле объекта перед записью:
	//Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"Исполнитель") Тогда
	//	Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) Тогда
	//		Объект.Исполнитель = Параметры.Исполнитель;	
	//	КонецЕсли;	
	//КонецЕсли;  
	
	ЗагрузитьКомментарийКЗадаче();
	
КонецПроцедуры                    

&НаСервере
Процедура ЗагрузитьКомментарийКЗадаче()

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;	
	
	ДиалогиЗадачиТаблица = РегистрыСведений.инкДиалогиКЗадачам.ПолучитьДиалогиКЗадачеТаблица(Объект.Ссылка);
	Для каждого ДиалогСтрока Из ДиалогиЗадачиТаблица Цикл
		мКомментарийКЗадаче = ДиалогСтрока.СообщениеДиалога.Получить(); 
		мИДСообщения = ДиалогСтрока.ИДСообщения;
		мДатаСообщения = ДиалогСтрока.Дата;
	КонецЦикла;      
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтотОбъект.Записать();
	ЭтотОбъект.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьНовоеСообщение(мКомментарийКЗадаче);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовоеСообщение(КомментарийКЗадаче)
	
	Если КомментарийКЗадаче.Элементы.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогКЗадачеСтрока = РегистрыСведений.инкДиалогиКЗадачам.СоздатьМенеджерЗаписи();
	ДиалогКЗадачеСтрока.ЗадачаПользователя = Объект.Ссылка;	
	ДиалогКЗадачеСтрока.Проект 		= Объект.Проект;	
	ДиалогКЗадачеСтрока.Дата		= мДатаСообщения;	
	ДиалогКЗадачеСтрока.Автор       = Пользователи.ТекущийПользователь();
	ДиалогКЗадачеСтрока.СообщениеДиалога = Новый ХранилищеЗначения(КомментарийКЗадаче, Новый СжатиеДанных(9));
	ДиалогКЗадачеСтрока.ИДСообщения = мИДСообщения;
	ДиалогКЗадачеСтрока.Записать(Истина);  
	
КонецПроцедуры 




