
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНачальнымиДанными(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Наименование;  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальнымиДанными(Параметры)

	Объект.Статус = Перечисления.инкСтатусыЗадач.БыстраяЗаметка;	

	Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"Проект") Тогда
		Объект.Проект = Параметры.Проект;
	КонецЕсли;

	Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"Исполнитель") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) Тогда
			Объект.Исполнитель = Параметры.Исполнитель;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтотОбъект.Записать();
	ЭтотОбъект.Закрыть();

КонецПроцедуры



