
Процедура ПередУдалением(Отказ)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗадачаПользователя) Тогда
		
		Попытка

			ЗадачаПользователяОбъект = ЭтотОбъект.ЗадачаПользователя.ПолучитьОбъект();
			ЗадачаПользователяОбъект.УстановитьПометкуУдаления(Истина);
			ЗадачаПользователяОбъект.Записать();

			ЗадачаПользователяОбъект = ЭтотОбъект.ЗадачаПользователя.ПолучитьОбъект();
			ЗадачаПользователяОбъект.ЗадачаПользователяИерархия = Неопределено;
			ЗадачаПользователяОбъект.Записать();
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

