
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить первый проект
// 
// Возвращаемое значение:
//  Ссылка - Ссылка на справочник "Проекты"
//
Функция ПолучитьПервыйПроект() Экспорт
	
	ПроектСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	инкПроектыКЗадачам.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.инкПроектыКЗадачам КАК инкПроектыКЗадачам
		|ГДЕ
		|	НЕ инкПроектыКЗадачам.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПроектСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать;
	КонецЦикла;
	
	Возврат ПроектСсылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли

